Revit 2024 API
ColumnAttachmentCutStyle Enumeration
 Control the handling of columns that intersect their targets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ColumnAttachmentCutStyle
Visual Basic
Public Enumeration ColumnAttachmentCutStyle
Visual C++
public enum class ColumnAttachmentCutStyle
Members
Member name | Description
CutColumn
CutTarget
None
See Also
Autodesk.Revit.DB Namespace